//7.Вывести на экран числа 5, 10 и 21 одно под другим.
using System;

class Task4
{
    static void Main()
    {
        Console.WriteLine(5);
        Console.WriteLine(10);
        Console.WriteLine(21);
    }
}
